Repository: SANJANAKONDIREDDY/Techmahindra_coe_assignments
Catalog: flutter_all/lib/l10n/app_*.arb
Languages: te

# enter_cause
source: Please enter a cause
te: దయచేసి ఒక కారణాన్ని నమోదు చేయండి

# cause_stress
source: Cause of Stress
te: ఒత్తిడికి కారణం

source: Select Date
te: తేదీ ఎంచుకోండి

# stress_deleted
source: Stress entry deleted!
te: ఒత్తిడి ప్రవేశం తొలగించబడింది!

# app_title
source: StressOmeter
te: స్ట్రెస్‌ఓమీటర్

# how_stressed_today
source: How Stressed Are We Today?
te: ఈ రోజు మనం ఎంత ఒత్తిడిగా ఉన్నాం?

# no_data_found
source: No past data found.
te: గత డేటా కనుగొనబడలేదు.

source: Stress Level
te: ఒత్తిడి స్థాయి

source: Cause
te: కారణం

source: Submit
te: సమర్పించండి

# stress_saved
source: Stress entry saved!
te: ఒత్తిడి ప్రవేశం భద్రపరచబడింది!
